Repository: ziirish/burp-ui
Catalog: burpui/translations/*/LC_MESSAGES/messages.po
Languages: es

source: This allows you to tweak the format of the timestamps of individual backups. See 'man strftime' to see available substitutions. If this option is unset, burp uses "%Y-%m-%d %H:%M:%S".
es: Esto le permite modificar el formato de las marcas de tiempo (timestamps) de respaldos individuales. Ver 'man strftime' para ver las sustituciones disponibles. Si esta opción no está definida, burp utiliza "%Y-%m-%d %H:%M:%S".

source: Set the file creation umask. Default is 0022.
es: Ajuste la máscara de usuario de creación del archivo (umask). El valor predeterminado es 0022.

source: Run as a particular user. This can be overridden by the client configuration files in clientconfdir on the server.
es: Ejecutar como un usuario en particular. Esto puede ser sobrescrito por los archivos de configuración del cliente en clientconfdir en el servidor.

source: When this is on, which is the default, a warning will be issued when the client version does not match the server version. This option can be overridden by the client configuration files in clientconfdir on the server.
es: Cuando está activado, el cual es el valor por defecto, una advertencia se emite cuando la versión del cliente no coincide con la versión del servidor. Esta opción puede ser sobrescrita por los archivos de configuración del cliente en clientconfdir en el servidor.

source: When backing up Windows computers, this option allows you to specify which drives have VSS snapshots taken of them. If you omit this option, burp will automatically decide based on the 'include' options. If you want no drives to have snapshots taken of them, you can specify '0'.
es: Cuando respalda los ordenadores Windows, esta opción le permite especificar qué unidades usan instantáneas VSS tomadas de ellos. Si se omite esta opción, burp automáticamente decidirá sobre la base de las opciones 'include'. Si desea que no hay unidades para tener instantáneas, puede especificar 0.

source: This option tells the server what to do when it finds the working directory of an interrupted backup (perhaps somebody pulled the plug on the server, or something). This can be overridden by the client configurations files in clientconfdir on the server. Options are... <ul><li>delete: Just delete the old working directory.</li><li>use: Convert the working directory into a complete backup.</li><li>resume: Simply continue the previous backup from the point at which it left off, at file granularity. NOTE: If the client has changed its include/exclude configuration since the backup was interrupted, the recovery method will automatically switch to 'use'. </li></ul>
es: Esta opción le dice al servidor qué hacer cuando se encuentra el directorio de trabajo de una respaldo interrumpe (tal vez alguien quitó el cable del servidor, o algo así). Esto puede ser sobrescrito por los archivos de configuración de cliente en clientconfdir en el servidor. Las opciones se ... <ul> <li> delete: Simplemente elimine el directorio de trabajo viejo </ li> <li> use:.. Convertir el directorio de trabajo en una respaldo completo </ ​​li> <li> resume: Simplemente siguen el respaldo anterior a partir del punto en que se interrumpió, con detalle de archivo. NOTA: Si el cliente ha cambiado su inclusión / exclusión de configuración desde que el respaldo se interrumpe, el método de recuperación cambiará automáticamente a 'use'.

source: is brought to you by
es: es traído a usted por

source: You can find the documentation at
es: Puede encontrar la documentación en

source: Browse the
es: navegar por

source: Administration
es: Administrar

source: Home
es: Inicio

source: %(server)s clients
es: %(server)s clientes

source: %(client)s overview
es: visión general %(client)s

source: Backup n°%(number)s overview
es: visión general de respaldo n°%(number)s

source: Backup n°%(number)s of %(client)s
es: Respaldo n°%(number)s de %(client)s

source: New
es: Nuevo

source: Changed
es: Cambiado

source: Unchanged
es: Sin cambios

source: Deleted
es: Eliminado

source: Scanned
es: Escaneado

source: Calendar
es: Calendario

source: Calendar of %(client)s on %(server)s
es: Calendario de %(client)s en %(server)s

source: Calendar of %(client)s
es: Calendario de %(client)s

source: Calendars of %(server)s
es: Calendarios de %(server)s

source: Calendars
es: Calendarios

source: filter...
es: Filtros de búsqueda...

source: options
es: opciones

source: Hide unmatched nodes
es: Ocultar nodos sin igual

source: Leaves only
es: sólo deja

source: Use regex
es: uso de expresiones regulares

source: This will only expand already loaded nodes to avoid flooding the server with the lazy-loading requests
es: Esto sólo se expandirá nodos ya cargados para evitar la inundación del servidor con las peticiones de carga perezosa

source: Expand tree
es: expandir el árbol

source: This may take some time depending the number of files in your backup
es: Este proceso puede tardar algún tiempo, dependiendo del número de archivos en la respaldo

source: Fetch all nodes
es: Cargar todos los nodos

source: Loading, Please wait...
es: Cargando, por favor espere ...

source: mode
es: modo

source: Size
es: Tamaño

source: Date
es: Fecha

source: Information
es: Información

source: This backup is encrypted, please provide the encryption password in order to perform an online restoration.
es: Esta respaldo está cifrado, proporcione la contraseña de cifrado con el fin de realizar una restauración en línea.

source: Download selected files
es: Descarga los archivos seleccionados

source: Number of leading path components to strip
es: Número de componentes de rutas líderes para strip

source: Archive format
es: formato de archivo

source: Encryption password
es: contraseña de cifrado

source: Server initiated restore
es: Restauración iniciada desde servidor

source: Prefix to the restore path
es: Prefijo a la ruta (path) de restauración

source: prefix
es: prefijo

source: Restore files on an other client
es: Restaurar archivos en otro cliente

source: none
es: ninguno

source: Whether to overwrite existing files
es: Sobrescribir los archivos existentes

source: Cancel restore
es: Cancelar la restauración

source: Clear selection
es: Quitar Selección

source: Processing request
es: Procesando...

source: Please wait while restoration is processing...
es: Por favor, espere mientras que la restauración está procesando ...

source: Close
es: Cerrar

source: Restoration error
es: Error de restauración

source: An error occurred while processing the restoration.
es: Se ha producido un error al procesar la restauración.

source: Statistics
es: Estadísticas

source: Backups
es: Respaldos

source: Toggle column:
es: Fijar columna:

source: Number
es: Número

source: Bytes received
es: bytes recibidos

source: Estimated size
es: tamaño estimado

source: Deletable
es: Eliminable

source: Status
es: Estados

source: <strong>Sorry!</strong> There are no backups for this client.
es: <strong>¡Lo siento!</strong> No hay respaldo para este cliente.

source: Edit restore
es: Editar restaurar

source: Schedule backup
es: Programar respaldo

source: Cancel backup
es: Cancelar respaldo

source: Global server report
es: Reporte global de servidor

source: Number of clients to display
es: Número de clientes a mostrar

source: All
es: Todo

source: Sort by
es: Ordenar por

source: number of backups
es: número de respaldos

source: number of files
es: número de filas

source: used space
es: espacio utilizado

source: Clients repartition
es: Repartición de clientes

source: Used space
es: Espacio utilizado

source: Total files
es: Total de archivos

source: Number of backups
es: Número de respaldos

source: Clients
es: Clientes

source: Name
es: Nombre

source: State
es: Estado

source: Last Backup
es: Último respaldo :

source: Live monitor
es: Monitor en vivo

source: Path
es: Ruta (path)

source: Phase
es: Fase

source: Time left
es: Tiempo restante

source: Warning<span ng-if="client.counters.warning > 1">s</span>
es: Advertencia<span ng-if="client.counters.warning > 1 ">s</span>

source: Speed
es: Velocidad

source: Login
es: Iniciar Sesión

source: You have selected %%d rows
es: Tienes seleccionadas %%d filas

source: Click a row to select it (hold ctrl to select several)
es: Click en una fila para seleccionar esta (manten ctrl para seleccionar varias)

source: You have selected 1 row
es: Seleccionaste 1 fila

source: Select all
es: Seleccionar todo

source: Deselect all
es: Quitar selección

source: <strong>Hello!</strong> Welcome to Burp-UI's demo. You can login with either <em>admin</em> / <em>admin</em> or with <em>demo</em> / <em>demo</em>.
es: <strong> ¡Hola! </strong> Bienvenido a burp-UI de demostración. Puede ingresar con <em> admin </em> / <em> admin </em> o con <em> demo </em> / <em> demo</em>.

source: Global report
es: Reporte global

source: Clients repartition per server
es: Reparticiones de cliente por servidor

source: Servers
es: Servidores

source: Burp Configuration of %(server)s
es: Configuración Burp de %(server)s

source: Burp Configuration
es: Configuración de Burp

source: Booleans
es: Booleano

source: Select an option
es: Seleccionar una opción

source: Strings
es: Cadenas texto

source: Integers
es: Enteros

source: Source external configuration files
es: Archivos de configuración fuente externos

source: source config
es: configuración fuente

source: Submit
es: Ingresar

source: Remove '%(client)s'
es: Remover '%(client)s'

source: Do not remove the configuration:
es: No remover la configuración:

source: Remove associated certificate:
es: Remover certificado asociado

source: Revoke associated certificate:
es: Revocar certificado asociado:

source: Administration navigation
es: Navegación por la administración

source: Users
es: Usuarios

source: Burp Settings
es: Ajustes Burp

source: Overview
es: Visión general

source: Reports
es: Informes

source: Configuration navigation
es: Navegación de configuración

source: Source files
es: Archivos de origen

source: Client to configure
es: Cliente a configurar

source: Select a client
es: Seleccionar un cliente

source: config:
es: configuración:

source: Create new client
es: Crear nuevo cliente

source: User settings navigation
es: Ajustes de usuario

source: Sessions
es: Sesiones

source: Preferences
es: Preferencias

source: Toggle navigation
es: Fijar navegación

source: About
es: Acerca de...

source: User settings
es: Ajustes de usuario

source: Logout
es: Cerrar sesión

source: Refresh
es: Refrescar

source: Search client...
es: Búsqueda de clientes ...

source: Last seen
es: Ultima vez visto

source: API Login
es: Inicio de sesion API

source: Current session
es: Sesión actual

source: Expire
es: Expirar

source: Current password
es: Contraseña actual

source: Required
es: Requerido

source: New password
es: Nueva contraseña

source: Confirm password
es: Confirmar contraseña

source: New password (confirm)
es: Nueva contraseña (confirmar):

source: Cancel
es: Cancelar

source: UI Settings
es: Configuraciones de UI

source: Items per page
es: Ítems por página

source: Date format
es: Formato de Fecha

source: Defaults to 'llll'
es: Por defecto 'III'

source: See <a href="%(url)s">here</a> for available formats
es: Ver <a href="%(url)s">aquí</a> por formatos disponibles

source: You are about to revoke a session, are you sure?
es: Usted está a punto de revocar una sesión, ¿está seguro?

source: Warning!
es: ¡Advertencia!

source: You are about to revoke your <strong>current</strong> session.
es: Vas a revocar su <strong> actual </ strong> sesión.

source: Confirm
es: Confirmar

source: Collapse tree
es: Colapsar árbol

source: Loading
es: Cargando

source: Nodes loaded
es: Nodos cargados

source: client crashed
es: cliente se estrelló

source: server crashed
es: servidor se estrelló

source: running
es: en curso

source: idle
es: inactivo

source: Encrypted backup
es: Respaldo cifrado

source: Unencrypted backup
es: Respaldo sin cifrar

source: never
es: nunca

source: now
es: ahora

source: Saving...
es: Guardando...

source: Preferences successfuly saved
es: Configuraciones guardadas correctamente

source: Select all filtered
es: Seleccionar todos filtrados

source: Deselect all filtered
es: Quitar selección de todos filtrados

source: Revoke selected
es: Revocar seleccionado

source: clients
es: clientes

source: servers
es: servidores
