Repository: ziirish/burp-ui
Catalog: burpui/translations/*/LC_MESSAGES/messages.po
Languages: es

source: Please log in to access this page.
es: Por favor inicia sesión para acceder a la página.

source: Please reauthenticate to access this page.
es: Por favor, vuelve a iniciar sesión para acceder a esta página.

source: Username
es: Usuario

source: Password
es: Contraseña

source: Language
es: Idiomas

source: Remember me
es: Recuérdame

source: Sorry, there are no running backups
es: Lo sentimos, no hay respaldos en progreso.

source: Sorry, there are no restore file found for this client
es: Lo sentimos, no hay archivo de restore encontrado para este cliente

source: Logged in successfully
es: Sesión iniciada con éxito

source: Wrong username or password
es: El nombre de usuario o la contraseña son incorrectos.

source: Wrong CSRF token, please try again
es: Token CSRF incorrecto, por favor intente de nuevo

source: max secs
es: segundos máximo

source: path
es: ruta(path)

source: some informations
es: algo de información

source: If acl support is compiled into burp, this allows you to decide whether or not to backup acls at runtime. The default is '1'.
es: Si el soporte de ACL se compila en burp, le permite decidir si o no respaldar las ACL durante el respaldo. El valor por defecto es '1'.

source: If xattr support is compiled into burp, this allows you to decide whether or not to backup xattrs at runtime. The default is '1'.
es: Si el soporte xattr se compila en burp, le permite decidir si desea o no xattrs durante el respaldo. El valor por defecto es '1'.

source: When running a timed backup, sleep for a random number of seconds (between 0 and the number given) before contacting the server. Alternatively, this can be specified by the '-q' command line option.
es: Cuando se ejecuta una respaldo programada, dormir por un número aleatorio de segundos (entre 0 y el número dado) antes de contactar con el servidor. Alternativamente, esto puede ser especificado por la opción de línea de comandos '-q'.

source: This can be overridden by the clientconfdir configuration files in clientconfdir on the server. When the server needs to delete old backups, or rubble left over from generating reverse patches with librsync=1, it will normally delete them in place. If you use the 'manual_delete' option, the files will be moved to the path specified for deletion at a later point. You will then need to configure a cron job, or similar, to delete the files yourself. Do not specify a path that is not on the same filesystem as the client storage directory.
es: Esto puede ser anulado por los archivos de configuración clientconfdir en clientconfdir en el servidor. Cuando el servidor tiene que eliminar respaldo antiguas, o escombros que quedaron de la generación de parches temporales de librsync = 1, lo habitual es eliminarlos en su lugar. Si se utiliza la opción 'manual_delete', los archivos se moverán a la ruta especificada para su eliminación en un momento posterior. A continuación, tendrá que configurar una tarea programada, o similar, para eliminar los archivos usted mismo. No especifique una ruta que no está en el mismo sistema de archivos como el directorio de almacenamiento del cliente.

source: You can have multiple labels, and they can be overridden in the client configuration files in clientconfdir on the server. They will appear as an array of strings in the server status monitor JSON output. The idea is to provide a mechanism for arbitrary values to be passed to clients of the server status monitor.
es: Puede tener múltiples etiquetas, y puede suprimirse en los archivos de configuración del cliente en clientconfdir en el servidor. Ellos van a aparecer como una matriz de cadenas en el estado del servidor en la salida JSON del burp status monitor. La idea es proporcionar un mecanismo para valores arbitrarios que se pasan a los clientes del burp status monitor.

source: To prevent the server from being able to override your local include/exclude list, set this to 0. The default is 1.
es: Para evitar que el servidor sobrescriba su configuración local para su lista de include/exclude, fijar a 0. El valor predeterminado es 1.

source: Set this to 0 if you do not want include_glob settings to be evaluated after the pre script is run. The default is 1.
es: Ponga esto a 0 si no desea que la configuración include_glob sea evaluada después de ejecutar el script: script_pre. El valor predeterminado es 1.

source: Set this to 0 if you want to disable all clients. The default is 1. This option can be overridden per-client in the client configuration files in clientconfdir on the server.
es: Ponga esto a 0 si desea desactivar todos los clientes. El valor predeterminado es 1. Esta opción puede ser anulada por cliente en los archivos de configuración del cliente en clientconfdir en el servidor.

source: Whether to keep fqdn cname (like 'testclient.example.com') when looking-up in clientconfdir. This also affects the fqdn lookup on the client (see client configuration options for details). The default is 1. When set to 0, the fqdn provided by the client while authenticating will be stripped ('testclient.example.com' becomes 'testclient').
es: Si desea mantener fqdn cname (como 'testclient.example.com') cuando se mira en clientconfdir. Esto también afecta a las operaciones de búsqueda fqdn en el cliente (ver opciones de configuración del cliente para más detalles). El valor por defecto es 1. Cuando se establece en 0, el fqdn provisto por el cliente será despojado ( 'testclient.example.com' se convierte en 'testclient').

source: Whether to force lowercase cname when looking-up in clientconfdir. This also affects the fqdn lookup on the client (see client configuration options for details). The default is 0. When set to 1 the name provided by the client while authenticating will be lowercased.
es: Si se debe forzar cname a minúscula cuando se mira en clientconfdir. Esto también afecta a las operaciones de búsqueda fqdn en el cliente (ver opciones de configuración del cliente para más detalles). El valor predeterminado es 0. Cuando se establece en 1 el nombre proporcionado por el cliente será en minúsculas al autenticarse.

source: path or glob
es: ruta o "glob"

source: name
es: nombre

source: string
es: cadena

source: extension
es: extensión

source: regular expression
es: expresión regular

source: groupname
es: nombre del grupo

source: number
es: número

source: file name
es: nombre de archivo

source: password
es: contraseña

source: port number
es: número de puerto

source: client
es: cliente

source: cipher list
es: lista de cifrado

source: strftime format
es: formato strftime

source: username
es: nombre de usuario

source: list of drive letters
es: lista de letras de unidad

source: Read additional configuration files. On Windows, the glob is unimplemented - you will need to specify an actual file.
es: Leer archivos de configuración adicionales. En Windows, glob no está implementado - necesitará para especificar un archivo real.

source: Defines the main TCP address that the server listens on. The default is either '::' or '0.0.0.0', dependent upon compile time options.
es: Define la dirección TCP principal que escucha el servidor. El valor predeterminado es '::' o '0.0.0.0', dependiendo de las opciones de tiempo de compilación.

source: This allows you to control whether the client uses O_NOATIME when opening files and directories. The default is 0, which enables O_NOATIME. This means that the client can read files and directories without updating the access times. However, this is only possible if you are running as root, or are the owner of the file or directory. If this is not the case (perhaps you only have group or world access to the files), you will get errors until you set atime=1. With atime=1, the access times will be updated on the files and directories that get backed up.
es: Esto le permite controlar si el cliente utiliza O_NOATIME al abrir archivos y directorios. El valor por defecto es 0, lo que permite O_NOATIME. Esto significa que el cliente puede leer los archivos y directorios sin actualizar los tiempos de acceso. Sin embargo, esto sólo es posible si está ejecutando como root, o eres el propietario del archivo o directorio. Si este no es el caso (tal vez sólo tiene grupo o acceso general a los archivos), se producirán errores hasta que se establece atime = 1. Con atime = 1, los tiempos de acceso se actualizarán en los archivos y directorios al respaldar.

source: Path to autoupgrade directory from which upgrades are downloaded. The option can be left unset in order not to autoupgrade clients. Please see docs/autoupgrade.txt in the source package for more help with this option.
es: Ruta (path) al directorio autoupgrade desde el cual se descargan las actualizaciones. La opción se puede dejar sin establecer con el fin de no auto actualizar clientes. Por favor, vea docs/autoupgrade.txt en el paquete fuente para obtener más ayuda con esta opción.

source: Path to the burp_ca script when using the ca_conf option.
es: Ruta (path) al script burp_ca cuando se utiliza la opción ca_conf.

source: Path to certificate authority configuration file. The CA configuration file will usually be /etc/burp/CA.cnf. The CA directory indicated by CA.cnf will usually be /etc/burp/CA. If ca_conf is set and the CA directory does not exist, the server will create, populate it, and the paths indicated by ssl_cert_ca, ssl_cert, ssl_key and ssl_dhfile will be overwritten. For more detailed information on this and the other ca_* options, please see docs/burp_ca.txt.
es: Ruta (path) al archivo de configuración de entidad emisora ​​de certificados (certificate authority). El archivo de configuración de CA por lo general será /etc/burp/CA.cnf. El directorio indicado por CA.cnf suele ser /etc/burp/CA. Si se establece ca_conf y no existe el directorio de CA, el servidor creará este y los caminos indicados por ssl_cert_ca, ssl_cert, ssl_key y ssl_dhfile serán sobrescritos. Para obtener información más detallada sobre esta y las otras opciones ca_ *, consulte docs/burp_ca.txt.

source: Name of the CA that the server will generate when using the ca_conf option.
es: Nombre de CA que el servidor generará cuando se utiliza la opción ca_conf.

source: The name that the server will put into its own SSL certficates when using the ca_conf option.
es: El nombre que el servidor va a poner en sus propios certificados SSL cuando utiliza la opción ca_conf.

source: Turn this off to prevent clients from deleting backups with the '-a D' option. The default is that clients can delete backups. Restore clients can override this setting.
es: Desactive esta opción para impedir que los clientes puedan eliminar los respaldos con la opción '-a D'. El valor por defecto es que los clientes pueden eliminar los respaldos. Los clientes "restore_client" pueden sobreescribir este ajuste.

source: Turn this off to prevent clients from forcing backups with the '-a b' option. Timed backups will still work. The default is that clients can force backups.
es: Desactive esta opción para impedir que los clientes puedan forzar el inicio de un respaldo con la opción '-a b'. Los respaldos programados seguirán funcionando '-a t'. El valor por defecto es que los clientes pueden forzar un respaldo.

source: Turn this off to prevent clients from listing backups with the '-a l' option. The default is that clients can list backups. Restore clients can override this setting.
es: Desactive esta opción para evitar que los clientes puedan listar los respaldos con la opción '-a l'. El valor por defecto es que los clientes pueden listar los respaldos. Los clientes 'restore_client' pueden sobrescribir este ajuste.

source: Turn this off to prevent clients from initiating restores with the '-a r' option. The default is that clients can initiate restores. Restore clients can override this setting.
es: Desactive esta opción para impedir que los clientes puedan iniciar restauraciones con la opción 'r -a'. El valor por defecto es que los clientes pueden iniciar las restauraciones. Los clientes 'restore_client' pueden sobrescribir este ajuste.

source: Turn this off to prevent clients from initiating a verify job with the '-a v' option. The default is that clients can initiate a verify job. Restore clients can override this setting.
es: Desactive esta opción para impedir que los clientes puedan iniciar una tarea de verificación con la opción 'v -a'. El valor por defecto es que los clientes pueden iniciar una tarea de verificación. Los clientes 'restore_client' pueden sobrescribir este ajuste.

source: Path to the directory in which to keep per-client lock files. By default, this is set to the path given by the 'directory' option.
es: Ruta (path) al directorio en el que guardar los ficheros de bloqueo por cliente (archivo 'lock'). De forma predeterminada, esto se establece en la ruta dada por la opción 'directory'.

source: Path to the directory that contains client configuration files.
es: Ruta (path) de acceso al directorio que contiene los archivos de configuración de clientes.

source: Choose the level of gzip compression for files stored in backups. Setting 0 or gzip0 turns compression off. The default is gzip9. This option can be overridden by the client configuration files in clientconfdir on the server.
es: Elegir el nivel de compresión gzip para los archivos almacenados en los respaldos. Ajuste 0 o gzip0 desactiva la compresión. El valor predeterminado es gzip9. Esta opción puede ser anulado por los archivos de configuración del cliente en clientconfdir en el servidor.

source: Allow backups to cross all filesystem mountpoints.
es: Permitir los respaldos en todos los puntos de montaje del sistema de archivos.

source: Allow backups to cross a particular filesystem mountpoint.
es: Permitir que los respaldos puedan cruzar un punto de montaje del sistema de archivos en particular.

source: Whether to daemonise. The default is 1.
es: Si correr como servicio/demonio 'daemonise'. El valor predeterminado es 1.

source: Enables you to group clients together for file deduplication purposes. For example, you might want to set 'dedup_group=xp' for each Windows XP client, and then run the bedup program on a cron job every other day with the option '-g xp'.
es: Permite agrupar a los clientes con fines de deduplicación. Por ejemplo, es posible que desee establecer 'dedup_group = XP' para cada cliente de Windows XP, y luego ejecutar el programa bedup en una tarea programada cada dos días con la opción '-g XP' (solo en protocol=1 se usa bedup, en protocol=2 es diferente).

source: When turned on (which is the default) and the client is on version 1.3.6 or greater, the structure of the storage directory will mimic that of the original filesystem on the client.
es: Cuando está activado (que es el valor predeterminado) y el cliente se encuentra en la versión 1.3.6 o superior, la estructura del directorio de almacenamiento imitará la del sistema de archivos original en el cliente.

source: Path to the directory in which to store backups.
es: Ruta al directorio donde almacenar los respaldos.

source: Extensions to exclude from compression. Case insensitive. You can have multiple exclude compression lines. For example, set 'gz' to exclude gzipped files from compression.
es: Extensiones que se deben excluir de la compresión. Insensible a mayúsculas y minúsculas (Case insensitive). Usted puede tener múltiples líneas de exclusiones de compresión. Por ejemplo, establecer 'gz' para excluir ficheros comprimidos de la compresión.

source: Extensions to exclude from the backup. Case insensitive. You can have multiple exclude extension lines. For example, set 'vdi' to exclude VirtualBox disk images.
es: Extensiones que se deben excluir del respaldo. Case insensitive (insensible a mayúsculas y minúsculas). Usted puede tener múltiples líneas de exclusiones de extensión. Por ejemplo, establecer 'VDI' para excluir las imágenes de disco de VirtualBox.

source: File systems to exclude from the backup. Case insensitive. You can have multiple exclude file system lines. For example, set 'tmpfs' to exclude tmpfs. Burp has an internal mapping of file system names to file system IDs. If you know the file system ID, you can use that instead. For example, 'exclude_fs = 0x01021994' will also exclude tmpfs.
es: Sistemas de archivos que se deben excluir del respaldo. Case insensitive. Usted puede tener múltiples líneas de exclusiones de sistema de archivos. Por ejemplo, 'tmpfs' para excluir tmpfs. Burp tiene una asignación interna de nombres de sistemas de archivo a ID del sistema de archivos. Si conoce el ID del sistema de archivos, puede utilizar este en su lugar. Por ejemplo, 'exclude_fs = 0x01021994' también excluye tmpfs.

source: Exclude paths that match the regular expression.
es: Excluir rutas (paths) que coincidan con la expresión regular.

source: Path to exclude from the backup. You can have multiple exclude lines. Use forward slashes '/', not backslashes '\' as path delimiters.
es: Ruta (path) a excluir del respaldo. Usted puede tener múltiples líneas de exclusiones. Utilice barras diagonales '/', no barras invertidas \ '' como delimitadores de ruta.

source: Whether to fork children. The default is 1.
es: Crear procesos hijos. El valor predeterminado es 1.

source: Run as a particular group. This can be overridden by the client configuration files in clientconfdir on the server.
es: Ejecutar como un grupo en particular. Esto puede ser anulado por los archivos de configuración del cliente en clientconfdir en el servidor.

source: Do not back up the client if the estimated size of all files is greater than the specified size. Example: 'hard_quota = 100Gb'. Set to 0 (the default) to have no limit.
es: No respaldar el cliente, si el tamaño estimado de todos los archivos es mayor que el tamaño especificado. Ejemplo: 'hard_quota = 100 Gb'. Se establece en 0 (por defecto) sin límite.

source: On the server, defines whether to keep hardlinked files in the backups, or whether to generate reverse deltas and delete the original files. Can be set to either 0 (off) or 1 (on). Disadvantage: More disk space will be used Advantage: Restores will be faster, and since no reverse deltas need to be generated, the time and effort the server needs at the end of a backup is reduced.
es: En el servidor, define si desea mantener los archivos hardlinked en los respaldos, o si se debe generar deltas inversa y borrar los archivos originales. Se puede establecer en 0 (desactivado) o 1 (activado). Desventaja: Más espacio en disco utilizado, Ventaja: Restaura más rápido, y puesto que no hay deltas inversa que necesitan ser generadas, se reduce el tiempo y esfuerzo que el servidor necesita al final de un respaldo (phase4 shuffling más rápido).

source: Extensions to include in the backup. Case insensitive. Nothing else will be included in the backup. You can have multiple include extension lines. For example, set 'txt' to include files that end in '.txt'. You need to specify an 'include' line so that burp knows where to start looking.
es: Extensiones para incluir en el respaldo. Case insensitive. Nada más se incluirá en el respaldo. Usted puede tener múltiples líneas de extensión para incluir. Por ejemplo, establecer 'txt' para incluir archivos que terminan en '.txt'. Es necesario especificar una línea de 'include' de manera que burp sabe dónde empezar a buscar.

source: Not implemented.
es: No implementado

source: Path to include in the backup. You can have multiple include lines. Use forward slashes '/', not backslashes '\' as path delimiters.
es: Path para incluir en el respaldo. Usted puede tener múltiples líneas "include". Utilice barras diagonales '/', no barras invertidas \ '' como delimitadores de ruta.

source: Include paths that match the glob expression.For example, '/home/*/Documents' will include '/home/user1/Documents' and '/home/user2/Documents' if directories 'user1' and 'user2' exist in '/home'. The Windows implementation currently limit the expression to contain only one '*'.
es: Incluir caminos que concuerde con la expresión glob.Por ejemplo, '/home/*/Documents' incluirá '/home/user1/Documents' y '/home/user2/Documents' si los directorios 'user1' y 'user2' existen en '/home'. En windows la implementación está limitada para contener solo un '*'.

source: Number of backups to keep. This can be overridden by the client configuration files in clientconfdir on the server. Specify multiple 'keep' entries on separate lines in order to keep multiple periods of backups. For example, assuming that you are doing a backup a day, keep=7 keep=4 keep=6 (on separate lines) will keep 7 daily backups, 4 weekly backups (7x4=28), and 6 multiples of 4 weeks (7x4x6=168) - roughly 6 monthly backups. Effectively, you will be guaranteed to be able to restore up to 168 days ago, with the number of available backups exponentially decreasing as you go back in time to that point. In this example, every 7th backup will be hardlinked to allow burp to safely delete intermediate backups when necessary. You can have as many 'keep' lines as you like, as long as they don't exceed 52560000 when multiplied together. That is, a backup every minute for 100 years.
es: Número de respaldo para mantener. Esto puede ser anulado por los archivos de configuración del cliente en clientconfdir en el servidor. Especificar múltiples entradas de 'keep' en líneas separadas con el fin de mantener varios períodos de respaldo. Por ejemplo, suponiendo que usted está haciendo una respaldo diario, keep=7 keep=4 keep=6 (en líneas separadas) mantendrá 7 respaldo diarias, 4 respaldo semanales (7x4 = 28), y 6 múltiplos de 4 semanas (7x4x6 = 168) - aproximadamente 6 respaldo mensuales. Efectivamente, se le garantiza ser capaz de restaurar hasta 168 días atrás, con el número de respaldo disponibles de forma exponencial decreciente a medida que avanza en el tiempo hasta ese punto. En este ejemplo, cada 7 (séptimo) respaldo será convertido en hardlinked para permitir a burp eliminar de manera segura los respaldos intermedios cuando sea necesario. Puede tener tantas líneas 'keep' como desee, siempre y cuando no excedan de 52.560.000 al ser multiplicados. Es decir, una respaldo cada minuto durante 100 años.

source: When set to 0, delta differencing will not take place. That is, when a file changes, the server will request the whole new file. The default is 1. This option can be overridden by the client configuration files in clientconfdir on the server.
es: Cuando se establece en 0, la diferenciación de diferencias (los delta) no se llevarán a cabo. Es decir, cuando se modifique un archivo, el servidor solicitará el archivo completo nuevo. El valor predeterminado es 1. Esta opción puede ser anulado por los archivos de configuración del cliente en clientconfdir en el servidor.

source: Path to the lockfile that ensures that two server processes cannot run simultaneously.
es: Path de acceso al fichero de bloqueo (archivo 'lock') que asegura que los dos procesos de servidor no se pueden ejecutar simultáneamente.
