Repository: ziirish/burp-ui
Catalog: burpui/translations/*/LC_MESSAGES/messages.po
Languages: es

source: If a path is given, the server will move directories to be deleted into the directory specified by the path, but will not actually delete them. The path must be on the same file system as the backup storage. The idea is that a busy server may be configured to run the deletions outside of the backup timebands, when the server is less busy, via a cron job. The default is unset, which means that the server will automatically delete the directories at the end of a backup. This option can be overridden by the client configuration files in clientconfdir on the server.
es: Si se da un path, el servidor moverá directorios para ser eliminados en el directorio especificado por el path, pero en realidad no los eliminará. La ruta debe estar en el mismo sistema de archivos como el almacenamiento de respaldo. La idea es que un servidor ocupado se puede configurar para ejecutar las supresiones fuera de las franjas horarias de respaldo, cuando el servidor está menos ocupado, a través de una tarea programada. El valor por defecto está definido, lo que significa que el servidor eliminará automáticamente los directorios al final de una respaldo. Esta opción puede ser anulado por los archivos de configuración del cliente en clientconfdir en el servidor.

source: Defines the number of child processes to fork (the number of clients that can simultaneously connect. The default is 5.
es: Define el número de procesos hijo a la mesa (el número de clientes que pueden conectarse simultáneamente. El valor por defecto es 5.

source: Do not back up files that are greater than the specified size. Example: 'max_file_size = 10Mb'. Set to 0 (the default) to have no limit.
es: No hacer respaldo de los archivos que son mayores que el tamaño especificado. Ejemplo: 'max_file_size = 10Mb'. Se establece en 0 (por defecto) no tener límite.

source: On the server, the number of times that a single file can be hardlinked. The bedup program also obeys this setting. The default is 10000.
es: En el servidor, el número de veces que un único archivo se puede hardlinked. El programa bedup también obedece esta configuración. El valor predeterminado es 10000.

source: Defines the number of status child processes to fork (the number of status clients that can simultaneously connect. The default is 5.
es: Define el número de procesos hijo de estado a la mesa (el número de clientes de estado que pueden conectarse simultáneamente. El valor por defecto es 5.

source: Defines the number of subdirectories in the data storage areas. The maximum number of subdirectories that ext3 allows is 32000. If you do not set this option, it defaults to 30000.
es: Define el número de subdirectorios en las áreas de almacenamiento de datos. El número máximo de subdirectorios que permite ext3 es 32000. Si no se establece esta opción, que por defecto es 30000. (ext4 no tiene límite de subdirectorios)

source: Do not back up files that are less than the specified size. Example: 'min_file_size = 10Mb'. Set to 0 (the default) to have no limit.
es: No hacer respaldo de los archivos que son menores que el tamaño especificado. Ejemplo: 'min_file_size = 10Mb'. Se establece en 0 (por defecto) no tiene límite.

source: Required to run in server mode.
es: Necesaria para ejecutar en modo de servidor.

source: Whether or not the server should cache the directory tree when a monitor client is browsing. <br/>Advantage: browsing is faster. </br>Disadvantage: more memory is used.
es: Si el servidor debe almacenar en caché el árbol de directorios del burp monitor cuando un cliente está navegando. Ventaja <br/>: la navegación es más rápida. </ br> Desventaja: se utiliza más memoria.

source: Set the network timeout in seconds. If no data is sent or received over a period of this length, burp will give up. The default is 7200 seconds (2 hours).
es: Ajuste el tiempo de espera de la red en cuestión de segundos. Si no hay datos enviando o recibiendo durante un período de esta longitud, burp se dará por vencido. El valor predeterminado es 7200 segundos (2 horas).

source: If this file system entry exists, the directory containing it will not be backed up.
es: Si existe esta entrada , el directorio que la contiene no será respaldado.

source: The same as notify_success_arg, but for backups that failed.
es: Lo mismo que notify_success_arg, pero para los respaldos que han fallado.

source: The same as notify_success_script, but for backups that failed.
es: Lo mismo que notify_success_script, pero para los respaldos que han fallado.

source: A user-definable argument to the notify success script. You can have many of these. The notify_success_arg options can be overridden by the client configuration files in clientconfdir on the server.
es: Un argumento definible por el usuario para el script de notificación exitosa. Usted puede tener muchos de estos. Las opciones notify_success_arg pueden ser sobrescritos los archivos de configuración del cliente en clientconfdir en el servidor.

source: Path to the script to run when a backup succeeds. User arguments are appended after the first five reserved arguments. An example notify script is provided. The notify_success_script option can be overridden by the client configuration files in clientconfdir on the server.
es: Path de acceso a la secuencia de comandos para ejecutar cuándo un respaldo tiene éxito. Los argumentos del usuario se añaden después de los primeros cinco argumentos reservados. Se proporciona un script de ejemplo para notificar. La opción notify_success_script puede sobrescrito por los archivos de configuración del cliente en clientconfdir en el servidor.

source: Set to 1 to send success notifications when there were warnings. If this and notify_success_changes_only are not turned on, success notifications are always sent.
es: Se establece en 1 para enviar notificaciones de éxito cuando no haya advertencias. Si esto y notify_success_changes_only están apagadas, las notificaciones de éxito siempre se envían.

source: Defines the password to send to the server.
es: Define la contraseña para enviar al servidor.

source: Allows you to turn client password checking on or off. The default is on. SSL certificates will still be checked if you turn passwords off. This option can be overridden by the client configuration files in clientconfdir on the server.
es: Permite apagar o encender la verificación del password del cliente. El valor por defecto está activada. Los certificados SSL todavía serán revisados ​​si a su vez las contraseñas se verifican. Esta opción puede ser sobrescrita por los archivos de configuración del cliente en clientconfdir en el servidor.

source: When this is on, which is the default, a warning will be issued when the client sends a path that is too long to replicate in the storage area tree structure. The file will still be saved in a numbered file outside of the tree structure, regardless of the setting of this option. This option can be overridden by the client configuration files in clientconfdir on the server.
es: Cuando está activado, el cual es el valor predeterminado, se emitirá un aviso cuando el cliente envía un path que es demasiado largo para replicarse en la estructura de árbol de área de almacenamiento. El archivo siempre se guardará en un archivo numerado fuera de la estructura del árbol de directorios, independientemente del ajuste de esta opción. Esta opción puede ser sobrescrita por los archivos de configuración del cliente en clientconfdir en el servidor.

source: Synonym for lockfile.
es: Sinónimo de fichero de bloqueo (archivo 'lock').

source: Defines the main TCP port that the server listens on.
es: Define el puerto TCP principal que escucha el servidor.

source: Choose which style of backups and restores to use. 0 (the default) automatically decides based on the server version and which protocol is set on the server side. 1 forces protocol1 style (file level granularity with a pseudo mirrored storage on the server and optional rsync). 2 forces protocol2 style (inline deduplication with variable length blocks). If you choose a forced setting, it will be an error if the server also chooses a forced setting.
es: Elegir qué estilo de respaldo y restauración se usa. 0 (por defecto) automáticamente decide, basándose en la versión del servidor y el protocolo que se establece en el lado del servidor. 1 fuerzas el estilo protocol1 (detalle de nivel de archivo con un pseudo reflejado de almacenamiento en el servidor y rsync opcional). 2 fuerzas de estilo protocol2 (deduplicación en línea con bloques de longitud variable). Si se elige un ajuste forzado, será un error si el servidor también elige un ajuste forzado.

source: Set the network send rate limit, in Mb/s. If this option is not given, burp will send data as fast as it can.
es: Establecer el límite de velocidad de envío por la red, en Mb/s. Si no se da esta opción, burp enviará datos tan rápido como se pueda.

source: Open all block devices for reading and back up the contents as if they were regular files.
es: Abre todos los dispositivos de bloque para la lectura y respalda los contenidos como si fueran archivos normales.

source: Open all fifos for reading and back up the contents as if they were regular files.
es: Abrir todas las memorias FIFO para la lectura y respalda los contenidos como si fueran archivos normales.

source: Do not back up the given block device itself, but open it for reading and back up the contents as if it were a regular file.
es: No respalda el dispositivo de bloque dado en sí mismo, pero abre este para leer y realizar respaldo del contenido como si fuera un archivo normal.

source: Do not back up the given fifo itself, but open it for reading and back up the contents as if it were a regular file.
es: No respalda FIFO dado en si mismo, pero abre para leer y realizar respaldo del contenido como si fuera un archivo normal.

source: A client that is permitted to list, verify, restore and delete files belonging to any other client. You may specify multiple restore_clients. If this is too permissive, you may set a restore_client for individual original clients in the individual clientconfdir files. Note that restoring a backup from a Windows computer onto a Linux computer will currently leave the VSS headers in place at the beginning of each file. This will be addressed in a future version of burp.
es: Un cliente que se permite para listar, verificar, restaurar y eliminar archivos que pertenecen a cualquier otro cliente. Puede especificar varios restore_clients. Si esto es demasiado permisivo, es posible configurar un restore_client para clientes individuales originales en los archivos de clientconfdir individuales. Tenga en cuenta que la restauración de unrespaldo de un equipo con Windows en un ordenador Linux dejará las cabeceras de VSS al principio de cada archivo. Este problema se solucionará en una versión futura de burp.

source: Turn this on to enable 'resume partial' code. Requires 'working_dir_recovery_method=resume'. When resuming an interrupted transfer of a single file, it attempts to use previously transferred blocks of that file in order to be more efficient. However, situations have been reported where the file on the server side just gets bigger forever, so this feature now defaults to being turned off.
es: Active este parámetro para permitir 'resumir parcial'. Requiere 'working_dir_recovery_method = resume'. Al reanudar una transferencia interrumpida de un solo archivo, intenta utilizar bloques previamente transferidas de ese archivo con el fin de ser más eficientes. Sin embargo, se han reportado situaciones donde el archivo en el servidor simplemente se hace más grande para siempre, por lo que esta función por defecto es desactivada.

source: When enabled, this causes problems in the phase1 scan (such as an 'include' being missing) to be treated as fatal errors. The default is off.
es: Cuando está activada, causa problemas en la exploración fase 1 (como un 'include' está ausente) a ser tratados como errores fatales. Por defecto está desactivada.

source: Goes with server_script and overrides server_script_pre_arg and server_script_post_arg.
es: Va con server_script y sobrescribe server_script_pre_arg y server_script_post_arg.

source: Turn on to send a notification emails when the server pre and post scripts return non-zero. The output of the script will be included it the email. The default is off. Requires the notify_failure options to be set.
es: Encienda para enviar notificaciones de correo cuando la salida del script pre y post del servidor no sea cero. La salida del script será incluída en el correo electrónico. Por defecto está desactivada. Requiere que las opciones notify_failure se establezcan.

source: A user-definable argument to the server post script. You can have many of these.
es: Un argumento definibles por el usuario para el script post del servidor. Usted puede tener muchos de estos.

source: Turn on to send a notification email when the server post script returns non-zero. The output of the script will be included in the email. The default is off. Requires the notify_failure options to be set.
es: Encienda para enviar una notificación por correo electrónico cuando el script de post del servidor devuelve distinto de cero. La salida del script será incluida en el correo electrónico. Por defecto está desactivada. Requiere que las opciones notify_failure se establezcan.

source: If this is set to 1, server_script_post will always be run. The default is 0, which means that if the task asked for by the client fails, server_script_post will not be run.
es: Si esto se establece en 1, siempre se llevará a cabo server_script_post. El valor por defecto es 0, lo que significa que si la tarea solicitada por el cliente falla, server_script_post no se ejecuta.

source: Path to a script to run on the server before the client disconnects. The arguments to it are 'post', '(client command)', '(client name), '(0 or 1 for success or failure)', '(timer script exit code)', and then arguments defined by server_script_post_arg. This command and related options can be overriddden by the client configuration files in clientconfdir on the server.
es: Path a un script a ejecutar en el servidor antes de que el cliente se desconecte. Este comando y los argumentos pueden ser sobrescritos por la configuración de cliente en los archivos dentro de clientconfdir en el servidor.

source: A user-definable argument to the server pre script. You can have many of these.
es: Un argumento definibles por el usuario para el script pre del servidor. Usted puede tener muchos de estos.

source: Turn on to send a notification email when the server pre script returns non-zero. The output of the script will be included in the email. The default is off. Most people will not want this turned on because clients usually contact the server at 20 minute intervals and this could cause a lot of emails to be generated. Requires the notify_failure options to be set.
es: Encienda para enviar una notificación por correo electrónico cuando el script del servidor pre devuelve un valor distinto de 0. La salida del script será incluido en el correo electrónico. Por defecto está desactivada. La mayoría de la gente no quiere esta opción activada porque los clientes suelen ponerse en contacto con el servidor en intervalos de 20 minutos y esto podría causar una gran cantidad de mensajes de correo electrónico. Requiere que las opciones notify_failure que se establezcan.

source: Path to a script to run on the server after each successfully authenticated connection but before any work is carried out. The arguments to it are 'pre', '(client command)', '(client name)', '(0 or 1 for success or failure)', '(timer script exit code)', and then arguments defined by server_script_pre_arg. If the script returns non-zero, the task asked for by the client will not be run. This command and related options can be overriddden by the client configuration files in clientconfdir on the server.
es: Path de script para ejecutar en el servidor después de cada conexión autenticada con éxito pero antes de cualquier trabajo se lleve a cabo. Los argumentos para esto son 'pre', '(cient command)', '(cient name)', '(0 o 1 para exitoso o fallido)', '(código de salida de script timer)', y los argumentos definidos por 'server_script_pre_arg'. Si el script no retorna 0, la tarea consultada al cliente no será ejecutada. Este comando y las opciones relacionadas se pueden sobrescribir por la configuración del cliente en los archivos de clientconfdir en el servidor.

source: You can use this to save space in your config file when you want to run the same server script twice. It overrides server_script_pre and server_script_post. This command and related options can be overriddden by the client configuration files in clientconfdir on the server.
es: Usted puede usar esto para ahorrar espacio en su archivo de configuración cuando se quiere ejecutar el mismo server script dos veces. Sobrescribe server_script_pre y server_script_post. Este comando y las opciones relacionadas se pueden sobrescribir por los archivos de configuración de cliente en clientconfdir en el servidor.

source: A warning will be issued when the estimated size of all files is greater than the specified size and smaller than hard_quota. Example: 'soft_quota = 95Gb'. Set to 0 (the default) to have no warning.
es: Una advertencia se emite cuando el tamaño estimado de todos los archivos es mayor que el tamaño especificado y más pequeño que hard_quota. Ejemplo: 'soft_quota = 95GB'. Se establece en 0 (por defecto) para tener ninguna advertencia.

source: When backing up Windows computers with burp protocol 1, this option allows you to save the VSS header data separate from the file data. The default is off, which means that the VSS header data is saved prepended to the file data.
es: Cuando respalda los ordenadores Windows con el protocolo burp 1, esta opción le permite guardar los datos VSS de cabecera separada de los datos del archivo. El valor por defecto está apagado, lo que significa que los datos de cabecera de VSS se guarda colocado al comienzo de los datos del archivo.

source: The path to the SSL CA certificate. This file will probably be the same on both the server and the client. The file should contain just the certificate in PEM format. For more information on this, and the other ssl_* options, please see <a href='http://burp.grke.org/docs/burp_ca.html'> docs/burp_ca.txt</a>.
es: La ruta al certificado CA SSL. Este archivo probablemente será el mismo tanto en el servidor y el cliente. El archivo debe contener sólo el certificado en formato PEM. Para obtener más información sobre esto, y el otro ssl_ * las opciones, consulte docs <a href='http://burp.grke.org/docs/burp_ca.html'>/burp_ca.txt </a>.

source: Synonym for ssl_key_password.
es: Sinónimo de ssl_key_password.

source: The path to the server SSL certificate. It works for me when the file contains the concatenation of the certificate and private key in PEM format.
es: La ruta de acceso al certificado SSL del servidor. A mí me funciona cuando el archivo contiene la concatenación del certificado y la clave privada en formato PEM.

source: Allowed SSL ciphers. See openssl ciphers for details.
es: Sistemas de cifrado SSL permitidos. Ver cifrados OpenSSL para obtener más detalles.

source: Choose the level of zlib compression over SSL. Setting 0 or zlib0 turnsSSL compression off. Setting non-zero gives zlib5 compression (it is not currently possible for openssl to set any other level). The default is 5. 'gzip' is a synonym of 'zlib'.is a synonym of 'zlib'.
es: Elegir el nivel de compresión zlib a través de SSL. Ajuste 0 o zlib0 quita la compresión. Ajuste distinto de cero da compresión zlib5 (no es posible en la actualidad para openssl para establecer cualquier otro nivel). El valor predeterminado es 5. 'gzip' es sinónimo de 'zlib'.

source: Path to Diffie-Hellman parameter file. To generate one with openssl, use a command like this: openssl dhparam -out dhfile.pem -5 1024
es: Path al archivo de parámetros Diffie-Hellman. Para generar una con OpenSSL, use un comando como el siguiente: openssl dhparam -out dhfile.pem -5 1024

source: The SSL key password.
es: La contraseña de la clave SSL.

source: The path to the server SSL private key in PEM format.
es: La ruta de acceso a la clave privada SSL del servidor en formato PEM.

source: Must match the common name in the SSL certificate that the server giveswhen it connects. If ssl_peer_cn is not set, the server name will be used instead.
es: Debe ser igual al nombre común en el certificado SSL que el servidor responde cuando este conecta. Si el ssl_peer_cn no está configurado, el nombre del servidor será usado entonces.

source: Defines the main TCP address that the server listens on for status requests. The default is either '::1' or '127.0.0.1', dependent upon compile time options.
es: Define la dirección TCP principal en que el servidor escucha las solicitudes de estado. El valor predeterminado es o bien ':: 1' o '127.0.0.1', dependiendo de las opciones de tiempo de compilación.

source: Defines the TCP port that the server listens on for status requests.
es: Define el puerto TCP que el servidor escucha las solicitudes de estado.

source: Log to stdout. Defaults to on.
es: Log a la salida estándar (stdout). Por defecto es encendido.

source: When backing up Windows computers with burp protocol 1, this option allows you to prevent the VSS header data being backed up. The default is off. To restore a backup that has no VSS information on Windows, you need to give the client the '-x' command line option.
es: Cuando respalda los ordenadores Windows con el protocolo burp 1, esta opción le permite evitar que los datos de cabecera de VSS sean respaldados. Por defecto está desactivada. Para restaurar una respaldo que no tiene información de VSS en Windows, es necesario dar al cliente la opción de línea de comandos '-x'.

source: Log to syslog. Defaults to off.
es: Log a syslog. El valor predeterminado es off.

source: A user-definable argument to the timer script.You can have many of these. The timer_arg options can be overridden by the client configuration files in clientconfdir on the server.
es: Un argumento definible por el usuario para el timer script. Puede tener muchos de estos. Las opciones timer_arg pueden ser sobrescritos por los archivos de configuración del cliente en clientconfdir en el servidor.

source: Path to the script to run when a client connects with the timed backup option. If the script exits with code 0, a backup will run. The first two arguments are the client name and the path to the 'current' storage directory. The next three arguments are reserved, and user arguments are appended after that. An example timer script is provided. The timer_script option can be overridden by the client configuration files in clientconfdir on the server.
es: Path de acceso al script para ejecutar cuando un cliente se conecta con la opción de respaldo programada (timed backup). Si el script finaliza con el código 0, se ejecutará el respaldo. Los dos primeros argumentos son el nombre del cliente y la ruta de acceso al directorio de almacenamiento. Los siguientes tres argumentos son reservados, los argumentos del usuario son agregados después de estos. Un ejemplo de timer script se provee. La opción time_script puede ser sobrescrito por el cliente en los archivos de configuración clientconfdir en el servidor.
